/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   push_swap.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: rnoda <rnoda@student.42tokyo.jp>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/07/20 16:36:37 by rnoda             #+#    #+#             */
/*   Updated: 2026/07/20 17:28:17 by rnoda            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


#include "push_swap.h"



void push_swap()
{

	t_double_linked_list stack_b;
	// stask_bの初期化
	return;
}

int main(int ac, char **av)
{
	t_double_linked_list stack_a;


	// 入力値のバリデーション

	// 正しい入力値ならばパースする
	// stack_a, bを初期化する
	// オプション指定があるかないかチェックする
	// chekerを使用する場合の入力かどうかチェックする

	// バリデーション完了


	// disorderの計算
	// ソート戦略の判断

	//
	push_swap();

	// 手順のリストを出力するか、ベンチマークを出力するか判断
	// output();
	return (0);
}